url = "http://sittpapc.ciics.cn"
username = "lihailong@ciics"
passwd = "lihailong123"
mysqluser = "lihailong"
mysqlpasswd = "lihailong123"
mysql_host = "10.9.19.71"

#证件类型
#codeType = "2"
#codeName = "军官证"
#codeType = "1"
#codeName = "护照"
codeType = "0"
codeName = "身份证"
#影像件个数
imageNum = 1

#渠道
#channel = "XH"
#TPA收单所需参数，保险公司，企业单位，保单号，报销类型，数量
#takeOrderParam = ["XXX保险基金管理公司","神华神东煤炭集团有限责任公司","202012140933","票据报销","门诊",1]
#takeOrderParam = ["XXX保险基金管理公司","神华神东煤炭集团有限责任公司","202012140933","社保数据二次报销","门诊",1]
#takeOrderParam = ["新华保险股份有限公司北京分公司","新增企业联调","772100314676","社保数据二次报销","门诊",1]
#takeOrderParam = ["新华保险股份有限公司北京分公司","新增企业联调","772100314676","票据报销","门诊",1]
#录入时出险人证件号码
#idCode = "bj09999292"
#袁军
#idCode = "152701197712100618"
#于利
#idCode = "210682199007092356"
#张鹏
#idCode = "61270119790928241X"
#陈海龙
#idCode = "612722196509223370"
#takeOrderParam = ["新华保险股份有限公司北京分公司","新增企业联调","77212205070001","票据报销","",1]
#idCode = "J222333454"

#渠道
channel = "RB"
#takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","中國皇家大江山集團有限公司","110000052233053","票据报销","",1]
#孙策四
#idCode = "370102200001012985"
#孙策三
#idCode = "340604200001010300"
#孙策一
#idCode = "622626200001019628"

#takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","中國皇家大江山集團有限公司","110000065708053","票据报销","",1]
#在职一
#idCode = "650202200001013243"
#退休一
#idCode = "533522196001014447"
#takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","非医保通人员勿操作","110001317428088","票据报销","",1]
#达非一
#idCode = "87346720001"
#王小一
#takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","非医保通人员勿操作","110001334240088","票据报销","",1]
#idCode = "2123456001"

#takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","非医保通人员勿操作","430000404660088","票据报销","",1]
#idCode = "2123456001"
#idCode = "140827200001010608"

#takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","中國皇家大江山集團有限公司","110000052019053","票据报销","",1]
#idCode = "622626200001010003"
takeOrderParam = ["中国人民人寿保险股份有限公司宁夏回族自治区分公司","非医保通人员勿操作","110001316990088","票据报销","",1]
idCode = "11010120010728030X"
